redditapp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dXymTmiscLm2EqXQjayumg=="], ["updated_at", "2021-09-24 19:31:38.669917"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(16)
        self.save!